# Lab | SQL Queries 9

In this lab, you will be using the Sakila database of movie rentals.

#### Create a Python connection with SQL database and retrieve the results of the following queries as dataframes:

In [1]:
import pandas as pd
import numpy as np

# for getting data from a SQL database
import pymysql                        

# for establishing the connection and authentication
from sqlalchemy import create_engine  

# To get the password WITHOUT showing the input
from getpass import getpass

In [2]:
#Add MySQL password, DON'T RUN, but ENTER
password = getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [4]:
type(engine)

sqlalchemy.engine.base.Engine

#### 1. How many distinct (different) actors' last names are there?

In [10]:
query = 'SELECT COUNT(DISTINCT last_name) AS distinct_last_names FROM sakila.actor'
display(query)
query_2 = pd.read_sql_query(query, engine)
query_2.head()

'SELECT COUNT(DISTINCT last_name) AS distinct_last_names FROM sakila.actor'

   distinct_last_names
0                  121

#### 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [11]:
query = 'SELECT *, IF(weekday(rental_date)<6,"workday","weekend") as day_type, WEEKDAY(rental_date) as checkday FROM rental'
display(query)
query_3 = pd.read_sql_query(query, engine)
query_3.head()

'SELECT *, IF(weekday(rental_date)<6,"workday","weekend") as day_type, WEEKDAY(rental_date) as checkday FROM rental'

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type,checkday
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,workday,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,workday,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,workday,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,workday,1
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,workday,1

#### 3. Get all films with ARMAGEDDON in the title.

In [23]:
query = 'SELECT title FROM film WHERE title LIKE "%%ARMAGEDDON%%"'
display(query)
query_4 = pd.read_sql_query(query, engine)
query_4.head()

'SELECT title FROM film WHERE title LIKE "%%ARMAGEDDON%%"'

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

#### 4. Get 10 the longest films.

In [28]:
#query = 'SELECT * FROM film ORDER BY length DESC LIMIT 10'
query = 'SELECT title, length FROM film ORDER BY length DESC LIMIT 11'
display(query)
query_5 = pd.read_sql_query(query, engine)
query_5.head(12)

'SELECT title, length FROM film ORDER BY length DESC LIMIT 11'

                 title  length
0         WORST BANGER     185
1        CHICAGO NORTH     185
2       DARN FORRESTER     185
3          GANGS PRIDE     185
4         POND SEATTLE     185
5            HOME PITY     185
6    SWEET BROTHERHOOD     185
7       CONTROL ANTHEM     185
8        MUSCLE BRIGHT     185
9   SOLDIERS EVOLUTION     185
10     MOONWALKER FOOL     184

#### 5. How many films include Behind the Scenes content?

In [24]:
query = 'SELECT COUNT(*) AS Behind_the_Scenes_included FROM film WHERE special_features LIKE "%%Behind_the_Scenes%%"'
display(query)
query_6 = pd.read_sql_query(query, engine)
query_6.head()

'SELECT COUNT(*) AS Behind_the_Scenes_included FROM film WHERE special_features LIKE "%%Behind_the_Scenes%%"'

   Behind_the_Scenes_included
0                         538

#### 6. Which kind of movies (rating) have a mean duration of more than two hours?

In [22]:
query = 'SELECT rating, ROUND(AVG(length), 2) AS Average FROM film GROUP BY rating HAVING average >120'
display(query)
query_7 = pd.read_sql_query(query, engine)
query_7.head()

'SELECT rating, ROUND(AVG(length), 2) AS Average FROM film GROUP BY rating HAVING average >120'

  rating  Average
0  PG-13   120.44

#### 7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [32]:
query = 'SELECT title, length, RANK() OVER(ORDER BY length DESC) AS rank_length FROM sakila.film'
display(query)
query_8 = pd.read_sql_query(query, engine)
query_8.head(20)

'SELECT title, length, RANK() OVER(ORDER BY length DESC) AS rank_length FROM sakila.film'

                 title  length  rank_length
0        CHICAGO NORTH     185            1
1       CONTROL ANTHEM     185            1
2       DARN FORRESTER     185            1
3          GANGS PRIDE     185            1
4            HOME PITY     185            1
5        MUSCLE BRIGHT     185            1
6         POND SEATTLE     185            1
7   SOLDIERS EVOLUTION     185            1
8    SWEET BROTHERHOOD     185            1
9         WORST BANGER     185            1
10   CONSPIRACY SPIRIT     184           11
11    CRYSTAL BREAKING     184           11
12      KING EVOLUTION     184           11
13     MOONWALKER FOOL     184           11
14     SMOOCHY CONTROL     184           11
15      SONS INTERVIEW     184           11
16      SORORITY QUEEN     184           11
17      THEORY MERMAID     184           11
18       CATCH AMISTAD     183           19
19      FRONTIER CABIN     183           19